
{
    "status": "success",
    "totalResults": 1083,
    "results": [
      {
        "title": "Global IT Spending Decreased in 2022",
        "link": "https://www.wsj.com/articles/global-it-spending-decreased-in-2022-11674002496?mod=rss_Technology",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Citing economic uncertainties, Gartner lowers its enterprise tech forecast for 2023.",
        "content": null,
        "pubDate": "2023-01-18 08:30:00",
        "image_url": null,
        "source_id": "wsj",
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Olisiko mahdollista, että tietoisuus ei enää olekaan orgaanisten eliöiden yksinoikeus?",
        "link": "https://tekniikanmaailma.fi/olisiko-mahdollista-etta-tietoisuus-ei-enaa-olekaan-orgaanisten-elioiden-yksinoikeus/",
        "keywords": [
          "Teknologia",
          "tekoäly"
        ],
        "creator": [
          "Markus Kasesmaa"
        ],
        "video_url": null,
        "description": "Joko tekoäly alkaa ottaa niskalinkkiä ihmisestä? Tätä on tullut viime aikoina pohdittua ChatGPT-tekoälyn kanssa chattaillessa. Siltä saatavat vastaukset ovat sekä kielellisesti että sisällöllisesti sitä luokkaa, että ulkopuolisen silmissä tekstin tuottajan alkuperä jää äkkiseltään tarkasteltuna hämäräksi. Itse asiassa ollaan jo siinä kehityksen vaiheessa, että ammatikseen kirjoittavillekin saattaa alkaa pukata kylmää hikeä. Tekniikka&Talous-lehti alkaa jopa julkaista omaa […]",
        "content": null,
        "pubDate": "2023-01-18 07:41:11",
        "image_url": "https://cdn.tekniikanmaailma.fi/wp-content/uploads/2017/03/markusk.jpg",
        "source_id": "tekniikanmaailma",
        "country": [
          "finland"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Hair follicle transplants can help heal your scars, says study",
        "link": "https://economictimes.indiatimes.com/news/science/hair-follicle-transplants-can-help-heal-your-scars-says-study/slideshow/97081819.cms",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "A recent study found that by receiving hair follicle transplants, skin scars started to act more like healthy skin such as producing new blood vessels, cells, collagen, and even expressed genes found in healthy unscarred skin. The research could result in more effective treatments for internal and external scarring, giving hope to patients with extensive scarring, which can impair organ function and cause disability.",
        "content": null,
        "pubDate": "2023-01-18 06:28:10",
        "image_url": "https://img.etimg.com/thumb/width-1200,imgsize-2417889,resizemode-4,msid-97081791/hair-follicle-transplants-can-help-heal-your-scars-says-study.jpg",
        "source_id": "economictimes_indiatimes",
        "country": [
          "india"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "title": "Kysy TM-toimitukselta: Onko oikeasti kiellettyä hiihtää ajoradalla?",
        "link": "https://tekniikanmaailma.fi/__trashed-23-13/",
        "keywords": [
          "Autot",
          "Kysy toimitukselta",
          "tieliikennelaki"
        ],
        "creator": [
          "Tekniikan Maailma"
        ],
        "video_url": null,
        "description": "Kysymys: Ylikomisario Dennis Pasterstein on lausunut, että ajoradalla hiihtäminen on kiellettyä ja että siitä tulee 20 euron maksulappu. Minä olen hiihtänyt ajoradalla joka talvi lyhyitä matkoja. Olenko syyllistynyt rikokseen? Hiihtäjä Hartolasta VASTAUS: Suksilla liikkuva määritellään tieliikennelain 2 pykälässä jalankulkijaksi, kuten myös luistimilla tai vastaavilla välineillä liikkuva ja potkukelkan, lastenvaunujen, leikkiajoneuvon, pyörätuolin, jalankulkua avustavan tai korvaavan liikkumisvälineen tai […]",
        "content": null,
        "pubDate": "2023-01-18 06:27:33",
        "image_url": "https://cdn.tekniikanmaailma.fi/wp-content/uploads/2017/04/kysy_toimitukselta.jpg",
        "source_id": "tekniikanmaailma",
        "country": [
          "finland"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Circles.Life partners M1 to launch its 5G standalone services in Singapore",
        "link": "https://www.hardwarezone.com.sg/tech-news-circleslife-partners-m1-launch-its-5g-standalone-services-singapore",
        "keywords": [
          "Just Announced"
        ],
        "creator": null,
        "video_url": null,
        "description": "Circles.Life added that its 5G SA enablement is differentiated from other no-contract 5G non-standalone (5G NSA) mobile plans, which in theory, should provide higher real-world speeds.",
        "content": "After announcing its plans to launch 5G services in August 2021 , Circles.Life is finally out of the dressing room and ready to play its role. The OG MVNO now offers 5G standalone (5G SA) connectivity to Singapore consumers, with the help of M1’s backbone network. With this update, Circles.Life joins other MVNO options like Zero1 (5G NSA), GOMO (5G NSA), Giga (5G NSA), and more recently MyRepublic (5G SA), to offer 5G MVNO services. Circles.Life added that its 5G SA enablement is differentiated from other no-contract 5G non-standalone (5G NSA) mobile plans, which in theory, should provide higher real-world speeds ( explainer here ). “Reinforcing the legacy of Singaporean companies at the forefront of the digital revolution, we are passionate about building the future of telecommunications with our valued partners M1 in our latest 5G SA co-launch. Fostering a culture of creativity and innovation is at the core of what we do best here at Circles.Life, and we are proud to step up and spearhead this charge with 5G SA as the catalyst of our sustained push towards greater digital transformation in 2023,” said Siddarth Chaturvedi, Country Head (Singapore & Taiwan), Circles.Life. A quick look at the Circles.Life official webpage sees three tiers of no-contract 5G SA plans, which we’ve broken down below. 5G upgrade included Free Caller ID Free Caller ID 300GB data rollover at 4G speeds, unlimited throttled data thereafter Prices shown above are for number transfers or existing CL users. New numbers +S$10 per month. Plans are promotion offers, with promo codes already applied during checkout process (offering different prices and/or allotments). eSIM option available. Existing Circles.Life users can use the Circles.Life app on their mobile phones to get the 5G SA upgrade. Number transfers (i.e. porting in from a different provider) get to enjoy the listed prices above, where brand-new numbers have an additional S$10 per month to all plans.",
        "pubDate": "2023-01-18 05:42:38",
        "image_url": null,
        "source_id": "hardwarezone",
        "country": [
          "singapore"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Päästäänkö autoja syövyttävästä suolasta lopultakin eroon? USA:ssa teiden suolaamiseen käytetään ”verisen litkun” näköistä juurikasnestettä",
        "link": "https://tekniikanmaailma.fi/paastaanko-autoja-syovyttavasta-suolasta-lopultakin-eroon-usassa-teiden-suolaamiseen-kaytetaan-verisen-litkun-nakoista-juurikasnestetta/",
        "keywords": [
          "Autot",
          "Liikenne",
          "suola",
          "talvi"
        ],
        "creator": [
          "Niko Rinta"
        ],
        "video_url": null,
        "description": "Suomessa tiesuola on ahkerassa käytössä, vaikka osassa tieosuuksia suolausta vähennetty onkin. Väyläviraston mukaan suolaa käytetään pääasiassa vilkkaimmilla teillä, noin 9 600 kilometrillä Suomen koko tiestöstä. Pohjois-Amerikassa tiesuolalle on löydetty vaihtoehdoksi suorastaan verisen näköinen litku, kirjoittaa Jalopnik. Tielle levitettävä punainen neste on itse asiassa sekoitus sokeri- tai punajuurikasta, suolaa ja vettä. Siinä missä suolan kyky sulattaa jäätä […]",
        "content": null,
        "pubDate": "2023-01-18 05:37:07",
        "image_url": "https://cdn.tekniikanmaailma.fi/wp-content/uploads/s3/2019/12/05101122/tiensuolaus-e1575534428634-1024x576.jpg",
        "source_id": "tekniikanmaailma",
        "country": [
          "finland"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Subscription pricing: Car makers want customers to keep paying for features that their cars already have",
        "link": "https://www.firstpost.com/tech/news-analysis/auto-industry-subscription-pricing-hardware-as-service-feature-as-service-12004452.html",
        "keywords": [
          "News"
        ],
        "creator": [
          "Mehul Reuben Das"
        ],
        "video_url": null,
        "description": "Subscription pricing: Car makers want customers to keep paying for features that their cars already have",
        "content": "Owning a car used to be simple – you put up a down payment and financing a portion of the car or you put down the entire amount to buy the car. Once you bought the car, you paid for the fuel, the annual insurance premiums, and at regular intervals, paid to get your car serviced. You really owned your car. But will that continue to be the case in the future?If the automobile industry has its way, they don’t want you to own your car, not completely at least. Car makers want you to pay more for the car you “own” and keep on paying till you have the car in your possession. And how do they go about doing it? By charging you for features that your car already has.A scary scenario Imagine this – you are out for a drive in your brand-new car after a hard week at the office. The car that you’re driving is the top-of-the-line version, with all the bells and whistles that the car company provides. You love driving and are having a good time. You try to tune the infotainment system to your favourite podcast, but you get a pop-up saying you need to pay a small fee to change what the infotainment system is playing for you. You ignore the message and try to adjust the climate control. You again get a popup saying that in order to change the temperature of your car’s air conditioner, you need to buy a subscription. Want to switch on your ventilated seats? There’s that pop-up notification again.Irritated by all this, you just keep on driving, until you find an empty stretch of road, and you think that you would love to try out the super-fast acceleration of your new car that your sales advisor kept on harping about. You press the pedal to the floor, expecting the car to take off like a stabbed rabbit, but instead, you see your car just roll off as it usually does – there’s a pop-up message again, saying that in order to experience the super quick acceleration your car is capable of, you need to subscribe to a hyper performance pack from your dealer, or from your car manufacturer. All of the things that we asked you to imagine, are happening in real life, today, as you’re reading this piece. Welcome to the dystopian world of hardware and feature being provided as services.The insidious trap Most car manufacturers have shareholders to whom they are answerable. And more than anything, shareholders want continued and explosive growth, and a sustained source of growing revenue. So how do car manufacturers ensure that their shareholders are happy? By coming up with a system that allows them to charge their customers more than what they pay for their cars, in the form of a recurring fee.Now, one way to go about this is to ensure that users service their cars at authorised service stations, where the markups are ridiculous. However, implementing that has proven to be a nightmare. Enter subscription pricing or Hardware/Feature as a Service. Automakers have made it clear that they view “Software as a Service,” as it is called in business parlance, as a substantial revenue stream that will help them recoup some of the billions of dollars they have invested in the research and development vehicles. Stellantis, the parent company of Jeep, Dodge, and Chrysler in the US, once stated that it anticipates making $22.5 billion annually from software and subscription revenues alone. Ford, Volkswagen, Daimler, BMW and General Motors have all made comparable predictions.What car manufacturers are actually doing Car manufacturers like BMW, Mercedes and Tesla have already implemented a paywall model where they charge a fee for the features that their cars are already capable of. For example, in a number of European and North American countries, BMW has features like heated seats and heated steering locked behind a paywall. Similarly, some of Tesla’s advanced features, like higher levels of ADAS or “autopilot” driving, are locked behind a paywall.One of the most insidious examples of this, however, would be Mercedes and what they have done with their EVs in North America. One of the hallmarks of an EV is the fast and instantaneous acceleration that its drivetrain provides. However, Mercedes has locked “increased” acceleration and other performance features behind a paywall that costs $1200 annually. The point of buying an EV or any car from Mercedes or any other premium brand like that instead of a Ford or Jeep, is the performance and speed that comes with it. What Mercedes has done here, is locked the essence of their car, behind, an annual paywall. Think of it this way – as a Mercedes customer in North America, you are not paying for more acceleration or better acceleration. You are being robbed of the regular acceleration that your swanky, brand-spanking-new Mercedes EV is capable of unless you pay an annual ransom. And mind you, Mercedes isn’t the only one doing this, other EV makers including Tesla, have similar practices when it comes to acceleration and performance. For years Tesla sold the Model S and Model X with the same 75 kWh battery but had the drivetrain locked by software to 60 and 70 kWh. The customer had the option to pay a one-time fee of an additional $3,000 for the extra 30 or 40 miles of range, or pay an annual fee to have the range unlocked.What car manufacturers plan to do Automobile manufacturers at least in Europe, North America and certain Asian countries, hope that going forward, they will have as few variants of a model, as possible – if possible, then only one, single variant. This one variant will have the hardware that is needed for all of the top-of-the-line features that they have to offer. This will allow car manufacturers not only to save cost in production and warehousing by streamlining manufacturing and having to make fewer SKUs or stock-keeping units but also, to charge more from customers – base variants have very little profit margins for car makers, so the idea is to eliminate base variants altogether. The car that you buy will have the hardware to support all of the features that you could possibly want. If you want to have a particular feature, you pay an annual fee. If you don’t want the feature while purchasing the car, you don’t need to pay the fee. However, if you want to activate the feature a few months down the line, you will need to pay a significantly higher fee annually. And yes, the packages are most likely to be charged annually in most cases. In certain use cases, subscriptions may be offered on a monthly basis, but then, they will be much more expensive proportionally. We have already seen a similar pricing principle being adopted for other subscription services. Users don’t own the car they own This brings us back to our original question. In the not-so-distant future, will you really own the car that you possess, whose EMIs and insurance premiums you pay? Not likely. This becomes even worse when you consider how quickly we are moving towards a world full of EVs, and where the internal combustion engine goes the way of the dinosaur. EVs will anyway rely extremely on software, even for the most basic of functionalities, all of which can be killed with the stroke of a key made remotely.Think of it this way- do you really own something if you need to pay an annual or even a monthly fee to use it to its fullest potential, or are you, at that point, simply renting it?",
        "pubDate": "2023-01-18 05:13:03",
        "image_url": "https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Subscription-pricing_-Car-makers-want-users-to-keep-paying-for-features-that-their-cars-already-have-.jpg",
        "source_id": "firstpost",
        "country": [
          "india"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Mikä on turvallisin paikka selvitä sisätiloissa ydinräjähdykseltä? Uusi tutkimus kertoo vastauksen",
        "link": "https://tekniikanmaailma.fi/mika-on-turvallisin-paikka-selvita-sisatiloissa-ydinrajahdykselta-uusi-tutkimus-kertoo-vastauksen/",
        "keywords": [
          "Tiede",
          "ydinräjähdys"
        ],
        "creator": [
          "Tekniikan Maailma"
        ],
        "video_url": null,
        "description": "Jos pahin mahdollinen tapahtuu ja ydinpommi räjähtää, missään ei ole turvallista. Uudessa tutkimuksessa on kuitenkin yritetty arvioida, missä on turvallisin paikka sisätiloissa ydinräjähdyksen sattuessa. Ydinräjähdyksen lähialueilla kaikki liian lähellä oleva höyrystyy välittömästi, ja räjähdyksen synnyttämä paineaalto aiheuttaa lisää vahinkoa – puhumattakaan tietysti säteilystä. Kreikkalaisen Nikosian yliopiston tutkijat ovat simuloineet Physics of Fluids -tiedejulkaisussa ilmestyneessä tutkimuksessa […]",
        "content": null,
        "pubDate": "2023-01-18 04:35:34",
        "image_url": "https://cdn.tekniikanmaailma.fi/wp-content/uploads/s3/2022/08/16080854/maailmanloppu-ydinpommi-t-1024x577.jpg",
        "source_id": "tekniikanmaailma",
        "country": [
          "finland"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "title": "Echidnas Blow Bubbles of Snot to Stay Cool in The Australian Outback",
        "link": "https://www.sciencealert.com/echidnas-blow-bubbles-of-snot-to-stay-cool-in-the-australian-outback",
        "keywords": null,
        "creator": [
          "Carly Cassella"
        ],
        "video_url": null,
        "description": "Gross, but effective.",
        "content": null,
        "pubDate": "2023-01-18 04:26:47",
        "image_url": null,
        "source_id": "sciencealert",
        "country": [
          "australia"
        ],
        "category": [
          "technology",
          "science",
          "health"
        ],
        "language": "english"
      },
      {
        "title": "You can't handle the truth! Indian government suggests its own fact checkers judge what's right on social media",
        "link": "https://go.theregister.com/feed/www.theregister.com/2023/01/18/india_it_rules_amendments/",
        "keywords": null,
        "creator": [
          "Simon Sharwood"
        ],
        "video_url": null,
        "description": "Classy: slips obviously conflicted idea in alongside changed gaming rules on last day of consultation period India's government has proposed to make itself the arbiter of what is true and what is not on social media.…",
        "content": "India's government has proposed to make itself the arbiter of what is true and what is not on social media. The plan emerged in draft amendments to India's IT (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 – a sweeping law that requires social media services to take down certain content, identify users, and appoint officers to handle citizen grievances. The government recently proposed amendments to the law that would require games developers to self-regulate so their wares don't cause financial harm to users. The amendments published yesterday detail that regime. But they also include a change to content takedown rules for social media that would require them to remove content \"identified as fake or false by the fact check unit at the Press Information Bureau of the Ministry of Information and Broadcasting or other agency authorised by the Central Government for fact checking or, in respect of any business of the Central Government.\" In other words, if the government doesn't like content, it could force social media operators to take it down. And if they don't, their Indian operations would be imperiled. Which is obviously problematic, because India's government can appoint officers to the Ministry of Information and Broadcasting. The Register has also reported the odd case of a government spokesperson seemingly having a role in initiating a police visit to Twitter's Indian HQ . India's Internet Freedom Foundation has taken issue with the amendments for two reasons. One is that having the government decide truth is an obvious conflict of interest. The other is that the amendments were dropped on the same day that public consultation on a previous version of the law were to end – meaning many stakeholders may already have had their say before the new amendments dropped. Additionally, this could also severely impact trust in any upcoming public consultations in 2023. Continuing piecemeal amendments as we wait for a ‘Digital India Bill’ without the articulation of clear vision or plan are matters of great concern. 4/4 The Ministry of Electronics and Information Technology has extended the consultation period – by just a week, despite copious amendments to the bill. Thus is India governed. ®",
        "pubDate": "2023-01-18 04:01:12",
        "image_url": null,
        "source_id": "theregister",
        "country": [
          "nigeria"
        ],
        "category": [
          "technology",
          "science"
        ],
        "language": "english"
      }
    ],
    "nextPage": 1
  }